nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f80000evk/demo_apps/bubble_peripheral/pin_mux.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOC3 (number 7), U12[7]
  @{ */
#define BOARD_Boot_RXD0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_Boot_RXD0_PIN 3U              /*!<@brief GPIOC pin index: 3 */
#define BOARD_Boot_RXD0_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOC2 (number 5), U12[6]
  @{ */
#define BOARD_Boot_TXD0_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_Boot_TXD0_PIN 2U              /*!<@brief GPIOC pin index: 2 */
#define BOARD_Boot_TXD0_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name GPIOC0 (number 3), Y1[1]/EXTAL
  @{ */
#define BOARD_EXTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_EXTAL_PIN 0U              /*!<@brief GPIOC pin index: 0 */
#define BOARD_EXTAL_PIN_MASK kGPIO_Pin0 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOF2 (number 39), J2[18]/U18[4]/LP_SDA0
  @{ */
#define BOARD_LP_SDA0_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LP_SDA0_PIN 2U              /*!<@brief GPIOF pin index: 2 */
#define BOARD_LP_SDA0_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOF3 (number 40), J2[20]/U18[5]/LP_SCL0
  @{ */
#define BOARD_LP_SCL0_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LP_SCL0_PIN 3U              /*!<@brief GPIOF pin index: 3 */
#define BOARD_LP_SCL0_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOF6 (number 58), U18[8]/J2[2]/D5/USER_LED1/INT1_COMBO
  @{ */
#define BOARD_LED_RED_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_LED_RED_PIN 6U              /*!<@brief GPIOF pin index: 6 */
#define BOARD_LED_RED_PIN_MASK kGPIO_Pin6 /*!<@brief PORT pin mask */
                                          /* @} */

/*! @name GPIOF8 (number 6), J21[2]/U18[7]/SW4/WAKE_UP
  @{ */
#define BOARD_WAKE_UP_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define BOARD_WAKE_UP_PIN 8U              /*!<@brief GPIOF pin index: 8 */
#define BOARD_WAKE_UP_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name GPIOF3 (number 40), J2[20]/U18[5]/LP_SCL0
  @{ */
#define ACCEL_INITPINS_LP_SCL0_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define ACCEL_INITPINS_LP_SCL0_PIN 3U              /*!<@brief GPIOF pin index: 3 */
#define ACCEL_INITPINS_LP_SCL0_PIN_MASK kGPIO_Pin3 /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name GPIOF2 (number 39), J2[18]/U18[4]/LP_SDA0
  @{ */
#define ACCEL_INITPINS_LP_SDA0_GPIO GPIOF          /*!<@brief GPIO device name: GPIOF */
#define ACCEL_INITPINS_LP_SDA0_PIN 2U              /*!<@brief GPIOF pin index: 2 */
#define ACCEL_INITPINS_LP_SDA0_PIN_MASK kGPIO_Pin2 /*!<@brief PORT pin mask */
                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Accel_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
